package com.example.eatopedia.data

object IngredientDictionary {
    val Ingredients = listOf(
        // Овочі
        "Картопля", "Морква", "Цибуля", "Часник", "Буряк", "Капуста", "Помідор",
        "Огірок", "Перець болгарський", "Баклажан", "Кабачок", "Гарбуз",
        "Кукурудза", "Горошок", "Квасоля", "Гриби", "Печериці", "Цвітна капуста",
        "Броколі", "Редька", "Селера", "Шпинат", "Салат", "Рукола", "Пастернак",
        "Петрушка", "Кінза", "Ревінь", "Томати черрі", "Ріпа", "Фенхель",

        // Фрукти та ягоди
        "Яблуко", "Банан", "Лимон", "Апельсин", "Мандарин", "Груша",
        "Виноград", "Полуниця", "Малина", "Чорниця", "Персик", "Авокадо",
        "Ківі", "Ананас", "Гранат", "Слива", "Абрикос", "Манго", "Кокос",
        "Маракуйя", "Грейпфрут", "Лайм", "Черешня", "Журавлина",
        "Фініки", "Інжир", "Гуава", "Папая",

        // М'ясо
        "Курка", "Куряче філе", "Свинина", "Яловичина", "Індичка",
        "Фарш свинний", "Фарш курячий", "Бекон", "Шинка",
        "Сосиски", "Ковбаса", "Сало", "Ягнятина", "Качка", "Гуска", "Кролик",

        // Риба та морепродукти
        "Лосось", "Тунець", "Скумбрія", "Хек", "Камбала",
        "Креветки", "Кальмари", "Мідії", "Восьминіг", "Краб",

        // Молочка та яйця
        "Яйця", "Молоко", "Сир твердий", "Сир кисломолочний", "Сметана",
        "Вершки", "Кефір", "Масло вершкове", "Йогурт", "Моцарела", "Рікота", "Пармезан", "Фета", "Бринза",

        // Бакалія і крупи
        "Хліб", "Батон", "Лаваш", "Борошно", "Манка", "Пшоняна крупа",
        "Рис", "Гречка", "Макарони", "Вівсянка", "Спагеті", "Перлова крупа", "Булгур",
         "Сода", "Розпушувач", "Мед", "Какао", "Шоколад", "Какао",

        // Олії та соуси
        "Олія соняшникова", "Олія оливкова", "Оцет", "Бальзамічний оцет",
        "Майонез", "Кетчуп", "Гірчиця", "Соєвий соус", "Томатна паста",
        "Соус теріякі", "Вустерширський соус", "Тахіні", "Сироп агави",

        // Спеції та зелень
        "Перець чорний", "Лавровий лист", "Паприка", "Кріп", "Петрушка", "Базилік",
        "Чебрець", "Розмарин", "Імбир", "Часниковий порошок", "Карі",
        "Цукор", "Сіль","Куркума", "Кмин", "Горіх мускатний", "Коріандр", "Сумах", "Шафран", "Чилі",

        // Горіхи та насіння
        "Мигдаль", "Грецькі горіхи", "Фісташки", "Соняшникове насіння", "Кунжут", "Арахіс",
        "Льон", "Чіа", "Кедрові горіхи", "Фундук", "Макадамія",

        // Напої та інше
        "Вода", "Чай", "Кава", "Сік", "Газована вода", "Молочний коктейль",
        "Вино", "Пиво", "Лимонад"
    ).sorted()
}